Revit 2024 API
UV Class
Object representing coordinates in 2-dimensional space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class UV
Visual Basic
Public Class UV
Visual C++
public ref class UV
Remarks
Usually this means parameters on a surface. In actual use, it could be interpreted as either point or vector in 2-dimensional space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.UV
See Also
UV Members
Autodesk.Revit.DB Namespace